// Generated by jextract

package net.hollowcube.luau.internal.vm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct lua_Debug {
 *     const char *name;
 *     const char *what;
 *     const char *source;
 *     const char *short_src;
 *     int linedefined;
 *     int currentline;
 *     unsigned char nupvals;
 *     unsigned char nparams;
 *     char isvararg;
 *     void *userdata;
 *     char ssbuf[256];
 * }
 * }
 */
public class lua_Debug {

    lua_Debug() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        lua_h.C_POINTER.withName("name"),
        lua_h.C_POINTER.withName("what"),
        lua_h.C_POINTER.withName("source"),
        lua_h.C_POINTER.withName("short_src"),
        lua_h.C_INT.withName("linedefined"),
        lua_h.C_INT.withName("currentline"),
        lua_h.C_CHAR.withName("nupvals"),
        lua_h.C_CHAR.withName("nparams"),
        lua_h.C_CHAR.withName("isvararg"),
        MemoryLayout.paddingLayout(5),
        lua_h.C_POINTER.withName("userdata"),
        MemoryLayout.sequenceLayout(256, lua_h.C_CHAR).withName("ssbuf")
    ).withName("lua_Debug");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final AddressLayout what$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("what"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *what
     * }
     */
    public static final AddressLayout what$layout() {
        return what$LAYOUT;
    }

    private static final long what$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *what
     * }
     */
    public static final long what$offset() {
        return what$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *what
     * }
     */
    public static MemorySegment what(MemorySegment struct) {
        return struct.get(what$LAYOUT, what$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *what
     * }
     */
    public static void what(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(what$LAYOUT, what$OFFSET, fieldValue);
    }

    private static final AddressLayout source$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("source"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *source
     * }
     */
    public static final AddressLayout source$layout() {
        return source$LAYOUT;
    }

    private static final long source$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *source
     * }
     */
    public static final long source$offset() {
        return source$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *source
     * }
     */
    public static MemorySegment source(MemorySegment struct) {
        return struct.get(source$LAYOUT, source$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *source
     * }
     */
    public static void source(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(source$LAYOUT, source$OFFSET, fieldValue);
    }

    private static final AddressLayout short_src$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("short_src"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *short_src
     * }
     */
    public static final AddressLayout short_src$layout() {
        return short_src$LAYOUT;
    }

    private static final long short_src$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *short_src
     * }
     */
    public static final long short_src$offset() {
        return short_src$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *short_src
     * }
     */
    public static MemorySegment short_src(MemorySegment struct) {
        return struct.get(short_src$LAYOUT, short_src$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *short_src
     * }
     */
    public static void short_src(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(short_src$LAYOUT, short_src$OFFSET, fieldValue);
    }

    private static final OfInt linedefined$LAYOUT = (OfInt)$LAYOUT.select(groupElement("linedefined"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int linedefined
     * }
     */
    public static final OfInt linedefined$layout() {
        return linedefined$LAYOUT;
    }

    private static final long linedefined$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int linedefined
     * }
     */
    public static final long linedefined$offset() {
        return linedefined$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int linedefined
     * }
     */
    public static int linedefined(MemorySegment struct) {
        return struct.get(linedefined$LAYOUT, linedefined$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int linedefined
     * }
     */
    public static void linedefined(MemorySegment struct, int fieldValue) {
        struct.set(linedefined$LAYOUT, linedefined$OFFSET, fieldValue);
    }

    private static final OfInt currentline$LAYOUT = (OfInt)$LAYOUT.select(groupElement("currentline"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int currentline
     * }
     */
    public static final OfInt currentline$layout() {
        return currentline$LAYOUT;
    }

    private static final long currentline$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int currentline
     * }
     */
    public static final long currentline$offset() {
        return currentline$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int currentline
     * }
     */
    public static int currentline(MemorySegment struct) {
        return struct.get(currentline$LAYOUT, currentline$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int currentline
     * }
     */
    public static void currentline(MemorySegment struct, int fieldValue) {
        struct.set(currentline$LAYOUT, currentline$OFFSET, fieldValue);
    }

    private static final OfByte nupvals$LAYOUT = (OfByte)$LAYOUT.select(groupElement("nupvals"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned char nupvals
     * }
     */
    public static final OfByte nupvals$layout() {
        return nupvals$LAYOUT;
    }

    private static final long nupvals$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned char nupvals
     * }
     */
    public static final long nupvals$offset() {
        return nupvals$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned char nupvals
     * }
     */
    public static byte nupvals(MemorySegment struct) {
        return struct.get(nupvals$LAYOUT, nupvals$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned char nupvals
     * }
     */
    public static void nupvals(MemorySegment struct, byte fieldValue) {
        struct.set(nupvals$LAYOUT, nupvals$OFFSET, fieldValue);
    }

    private static final OfByte nparams$LAYOUT = (OfByte)$LAYOUT.select(groupElement("nparams"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned char nparams
     * }
     */
    public static final OfByte nparams$layout() {
        return nparams$LAYOUT;
    }

    private static final long nparams$OFFSET = 41;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned char nparams
     * }
     */
    public static final long nparams$offset() {
        return nparams$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned char nparams
     * }
     */
    public static byte nparams(MemorySegment struct) {
        return struct.get(nparams$LAYOUT, nparams$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned char nparams
     * }
     */
    public static void nparams(MemorySegment struct, byte fieldValue) {
        struct.set(nparams$LAYOUT, nparams$OFFSET, fieldValue);
    }

    private static final OfByte isvararg$LAYOUT = (OfByte)$LAYOUT.select(groupElement("isvararg"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char isvararg
     * }
     */
    public static final OfByte isvararg$layout() {
        return isvararg$LAYOUT;
    }

    private static final long isvararg$OFFSET = 42;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char isvararg
     * }
     */
    public static final long isvararg$offset() {
        return isvararg$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char isvararg
     * }
     */
    public static byte isvararg(MemorySegment struct) {
        return struct.get(isvararg$LAYOUT, isvararg$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char isvararg
     * }
     */
    public static void isvararg(MemorySegment struct, byte fieldValue) {
        struct.set(isvararg$LAYOUT, isvararg$OFFSET, fieldValue);
    }

    private static final AddressLayout userdata$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("userdata"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *userdata
     * }
     */
    public static final AddressLayout userdata$layout() {
        return userdata$LAYOUT;
    }

    private static final long userdata$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *userdata
     * }
     */
    public static final long userdata$offset() {
        return userdata$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *userdata
     * }
     */
    public static MemorySegment userdata(MemorySegment struct) {
        return struct.get(userdata$LAYOUT, userdata$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *userdata
     * }
     */
    public static void userdata(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(userdata$LAYOUT, userdata$OFFSET, fieldValue);
    }

    private static final SequenceLayout ssbuf$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("ssbuf"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char ssbuf[256]
     * }
     */
    public static final SequenceLayout ssbuf$layout() {
        return ssbuf$LAYOUT;
    }

    private static final long ssbuf$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char ssbuf[256]
     * }
     */
    public static final long ssbuf$offset() {
        return ssbuf$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char ssbuf[256]
     * }
     */
    public static MemorySegment ssbuf(MemorySegment struct) {
        return struct.asSlice(ssbuf$OFFSET, ssbuf$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char ssbuf[256]
     * }
     */
    public static void ssbuf(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ssbuf$OFFSET, ssbuf$LAYOUT.byteSize());
    }

    private static long[] ssbuf$DIMS = { 256 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char ssbuf[256]
     * }
     */
    public static long[] ssbuf$dimensions() {
        return ssbuf$DIMS;
    }
    private static final VarHandle ssbuf$ELEM_HANDLE = ssbuf$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char ssbuf[256]
     * }
     */
    public static byte ssbuf(MemorySegment struct, long index0) {
        return (byte)ssbuf$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char ssbuf[256]
     * }
     */
    public static void ssbuf(MemorySegment struct, long index0, byte fieldValue) {
        ssbuf$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

